<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class QurantafseerSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        \DB::table('qurantafseers')->delete();

        \DB::table('qurantafseers')->insert([
            ['id'=>'1','name'=>'ตัฟซีรฺอิบนุกะษีรฺ : 1.ซูเราะฮฺ อัลฟาติหะฮฺ','qurantafseer'=>' ซูเราะฮฺนี้มีชื่อว่า “อัลฟาติหะฮฺ : الفاتحة”(ผู้เปิด) หมายถึงผู้เปิดคัมภีร์(อัลกุรอาน)ที่ได้มีการเขียนบันทึกขึ้น และซูเราะฮฺอัลฟาติหะฮฺนี้เป็นคำเปิดอ่านในละหมาด มีบางคนเรียกว่า อุมมุลกิตาบ:أم الكتاب (แม่ของคัมภีร์อัลกุรอาน) แต่อะนัซ อัลหะซันและอิบนุซีรีน ไม่เห็นด้วยกับการเรียกชื่อซูเราะฮฺนี้ว่า อุมมุลกิตาม เพราะอัลหะซันและอิบนุซีรีน มีความเห็นว่า ชื่อ อุมมุลกิตาบนี้เป็นชื่อของ เลาฮุลมะหิชฺฟูซ(اللوح المحفوظ)[1] อัลหะซันกล่าวว่า อายาตุลมุหฺกะมาต(โองการที่มีข้อความรัดกุมชัดเจน) คือ อุมมุลกิตาบ(แม่ของคัมภีร์) ดังนั้นทั้งสองคนจึงไม่เห็นด้วยที่จะให้ชื่อซูเราะฮฺอัลฟาติหะฮฺว่า อุมมุลกุรอาน(แม่ของอัลกุรอาน)เช่นกัน

            หะดีษเศาะหีหฺอัตติรมีซีย์และท่านได้ยืนยันว่าเป็นหะดีษที่น่าเชื่อถือ(เศาะหีหฺ) ท่านได้บันทึกไว้ว่า อะบูฮุร็อยเราะฮฺ(รอฎิฯ) ได้รายงานว่า เราะซูลุลลอฮฺ(ศ็อลฯ)ได้กล่าวว่า
            
            ” الْحَمْد لِلَّهِ رَبّ الْعَالَمِينَ أُمّ الْقُرْآن وَأُمّ الْكِتَاب وَالسَّبْع الْمَثَانِي وَالْقُرْآن الْعَظِيم “
            
            (الْحَمْد لِلَّهِ رَبّ الْعَالَمِينَ(ซูเราะฮฺอัลฟาติหะฮฺ) คือ แม่ของอัลกุรอาน แม่ของคัมภีร์ เจ็ดอายาตที่ถูกอ่านซ้ำๆและอัลกุรอานที่ยิ่งใหญ่)
            
            ซูเราะฮฺอัลฟาติหะฮฺนี้ บางที่มีคนให้ชื่อว่า อัลหัมดุ: الْحَمْد (บรรดาการสรรเสริญ) และบางคนให้ชื่อว่า ศอลาฮฺ: الصَّلَاة(การละหมาด) เพราะท่านนบี(ศ็อลฯ)ได้กล่าวถึงคำตรัสของอัลลอฮฺ ว่า อัลลอฮฺได้ตรัสว่า
            
            ” قَسَمْت الصَّلَاة بَيْنِي وَبَيْن عَبْدِي نِصْفَيْنِ فَإِذَا قَالَ الْعَبْد الْحَمْد لِلَّهِ رَبّ الْعَالَمِينَ قَالَ اللَّه حَمِدَنِي عَبْدِي ”
            
            (ฉันได้แบ่งการละหมาดระหว่างกับบ่าวของฉันสองส่วน เมื่อบ่าวกล่าวว่า الْحَمْد لِلَّهِ رَبّ الْعَالَمِينَ (บรรดาการสรรเสริญเป็นของอัลลอฮฺพระผู้อภิบาลสากลโลก) อัลลอฮฺตรัสว่า บ่าวของฉันได้สรรเสริญฉัน) (หะดีษ)
            
            ซูเราะฮฺอัลฟาติหะฮฺที่ถูกให้ชื่อว่า صَّلَاة (การละหมาด) เพราะซูเราะฮฺนี้เป็นส่วนหนึ่งในเงื่อนไขของการละหมาด)
            
            บางคนก็ใช้ชื่อว่า ชีฟาอฺ: الشِّفَاء (การรักษา) เพราะมีรายงานจากอัดดาริมีย์ จากอะบูซะอีด อ้างอิงถึงทานนบี(ศ็อลฯ) ว่า
            
            ” فَاتِحَة الْكِتَاب شِفَاء مِنْ كُلّ سُمّ”
            
            (ฟาติหะตุลกิตาม(ซูเราะฮฺอัลฟาติหะฮฺ) คือ การรักษาพิษทุกชนิด)
            
            ซูเราะฮฺนี้ก็เป็นที่รู้จักเช่นกันว่าเป็นซูเราะฮฺ “รุกยะฮ:الرُّقْيَةُ”(การปัดเปา) เพราะมีหะดีษเศาะหีหฺที่รายงานโดย อะบูซะอีด เมื่อเขาได้อ่านปัดเปาผู้ชายสุขาภาพดีคนหนึ่ง(เมื่อโดนสัตว์เล็กสัตว์น้อยกัด) ท่านเราะซูลุลลอฮฺ(ศ็อลฯ)ได้ถามเขาว่า
            
            “وَمَا يُدْرِيك أَنَّهَا رُقْيَة”
            
            (เจ้ารู้มาจากไหนว่าซูเราะฮฺนี้สามารถอ่านแล้วเปาให้เขาหายเจ็บ(รุกยะฮฺ)ได้)(อัลบุคอรีย์ : 2166)
            
            อัชชะอฺบีย์ รายงานว่า อิบนุอับบาซได้ให้ชื่อซูเราะฮฺนี้ว่าเป็น“อะซาซุลกุรอาน: أَسَاس الْقُرْآن ” (ฐานอัลกุรอาน) และฐานของอัลกุรอานนี้คือ بِسْمِ اللَّه الرَّحْمَن الرَّحِيم (ด้วยพระนามของอัลลอฮฺผู้ทรงเมตตาปราณี)
            
            ซุฟยาน อิบนุ อุยัยนะฮฺ ได้ให้ชื่อซูเราะฮฺนี้ว่า “อัลวากียะฮฺ:الْوَاقِيَةِ”(การป้องกัน)
            
            ยะหฺยา อิบนุ กะษีรฺ ได้ให้ชื่อว่า “อัลกาฟิยะฮฺ: كَافِيَة”(เพียงพอ) เพราะซูเราะฮฺ อัลฟาติหะฮฺนี้เพียงพอกับตัวเขาเองแม้จะไม่มีซูเราะฮฺอื่น แต่ซูเราะฮฺอื่นไม่มีซูเราะฮฺอัลฟาติหะฮฺก็ถือว่าไม่เพียงพอ ดังที่มีรายงานจากหะดีษมุรซัล[2]บางหะดีษว่า
            
            ” أُمُّ الْقُرْآنِ عِوَضٌ مِنْ غَيْرِهَا، وَلَيْسَ غَيْرُهَا عِوَضًا عَنْهَا ”
            
            (อุมมุลกุรอาน(ซูเราะฮฺอัลฟาติหะฮฺ)สามารถที่จะทดแทนซูเราะฮฺได้ แต่ซูเราะฮฺอื่นไม่สามารถที่จะทดแทนซูเราะฮฺอัลฟาติหะฮฺได้) (อัลไบหะกีย์ :2/165, อัลหากิม :1/238)
            
            และซูเราะฮฺนี้ก็ถูกให้ชื่อว่า ซูเราะฮฺ เศาะลาฮฺวะกันซุน“الصَّلَاة وَالْكَنْز”(ละหมาดและขุมทรัพย์) ตามที่อัชชะมัคชะรีย์ได้กล่าวในหนังสือ อัลกัชชาฟ(الكَشَّاف) ของเขา
            
            อิบนุอับบาซ เกาะตาดะฮฺและอะบูอาลียะฮฺ ได้กล่าวว่าซูเราะฮฺอัลฟาติหะฮฺนี้เป็นซูเราะฮฺมักกียะฮฺ(مَكّيَة) หมายถึงเป็นซูเราะฮฺที่ประทานลงในขณะที่นบีอยู่ ณ เมืองมักกะฮฺ
            
            อะบูฮุร็อบเราะฮฺ, มุญาฮิด, อะฏออฺ อิบนุ ยะซารฺและอัซซัฮฺรีย์ กล่าวว่า ซูเราะฮฺนี้เป็นซูเราะฮฺมะดะนียะฮฺ(مَدَنِيَّة) หมายถึงเป็นซูเราะฮฺที่ประทานลงในระหว่างที่นบีอยู่มะดีนะฮฺ แต่ก็มีอีกความเห็นกล่าวว่าซูเราะฮฺนี้ประทานลงมา 2 ครั้ง ครั้งหนึ่งที่มักกะฮฺและอีกครั้งที่มะดีนะฮฺ
            
            ความเห็นแรก(มักกียะฮฺ)เป็นความเห็นที่น่าจะถูกต้องมากที่สุด เพราะอัลลอฮฺได้ตรัสว่า
            
            ﴿وَلَقَدْ آتَيْناكَ سَبْعاً مِنَ الْمَثانِي﴾
            
            (และโดยแน่นอน เราได้ให้แก่เจ้าเจ็ดอายาตที่ถูกอ่านซ้ำ และอัลกุรอานที่ยิ่งใหญ่) (อัลหิจรฺ 15:87)
            
            วัลลอฮุอะอฺลัม(อัลลอฮฺเท่านั้นที่ทรงรู้ยิ่ง)
            
            อะบูไลษ์ อัซซะมัรฺก็อนดี ได้กล่าวว่า ครึ่งหนึ่งของซูเราะฮฺนี้ประทานที่มักกะฮฺอีกครึ่งหนึ่งประทานลงมาที่มะดีนะฮฺ แต่ความเห็นนี้เป็นความเห็นที่โดดเดี่ยว(غريب:เฆาะรีบ)[3]มาก และอัลกุรฏุบีย์ได้คัดลอกมาจากเขา
            
            ซูเราะฮฺอัลฟาติหะฮฺนี้มีทั้ง 7 อายาต โดยไม่มีใครมาขัดแย้ง แต่มีอัมรู อิบนุ อะไบด์ กล่าวว่ามี 8 อายาต และหุไซน์ อัลญุอฺฟีย์ กล่าวว่ามี 6 อายาต แต่ความเห็นของสองคนนี้ เป็นความเห็นที่ชาษ์:شاذ[4] (ผิดปกติ)
            
            ที่บรรดาอุลามาอฺมีความเห็นไม่ตรงกันของอายะฮฺในซูเราะฮฺนี้ คืออายะฮฺ บัซมะละฮฺ (بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ) บางคนถือว่าเป็นอายะฮฺต่างหากหนึ่งอายะฮฺ อย่างที่นักอ่านอัลกุรอานกูฟะฮฺส่วนใหญ่ที่มีความเห็นกัน บรรดาเศาหาบะฮฺ บรรดาตาบีอีนและกลุ่มคนซะลัฟก็ได้ให้เห็นเช่นนี้เช่นกัน บางคนถือว่าบิซมิลละฮฺนี้เป็นส่วนหนีี่งของอายะฮฺอัลกุรอาน คือไม่นับว่าเป็นอายะฮฺๆหนึ่ง อย่างที่ชาวมะดีนะฮฺที่เป็นนักอ่านอัลกุรอานและเป็นศาสนบัญญัติ(ฟุเกาะฮาอฺ)เขาได้มีความเห็นกัน ความเห็นที่แตกต่างกันในเรื่องนี้ เราจะกล่าวอย่างรายละเอียดข้างหน้าในบทที่พูดถึงเรื่องนี้ อินชาอัลลอฮฺ(หากอัลลอฮฺทรงประสงค์)
            
            บรรดานักวิชาการให้ลงความเห็นว่า จำนวนคำในซูเราะฮฺอัลฟาติหะฮฺนี้มีทั้งหมด 25 คำ และมีตัวอักษรทั้งหมด 113 ตัวอักษร
            
            อิมามอัลบุคอรีย์ ได้กล่าวไว้ในหนังสือตัฟซีรฺว่า ที่ซูเราะฮฺอัลฟาติหะฮฺถูกเรียกว่า อุมมุลกิตาม: أُمُّ الْكِتَابِ  (แม่คำภีร์) เพราะว่าซูเราะฮฺนี้เป็นซูเราะฮฺแรกเริ่มที่เขียนลงในหนังสืออัลกุรอาน และอายะฮฺแรกเริ่มอ่านในละหมาด (เศาะหีหุลบุคอรีย์ 8/155)
            
            บางคนกล่าวว่า ที่เรียกว่าอุมมุลกุรอานนี้ เพราะเนื้อหาที่อยู่ในซูเราะฮฺนี้ครอบคลุมความหมายอัลกุรอานทั้งหมด
            
            อิบนุญะรีรฺ ได้กล่าวว่า คนอาหรับจะให้ชื่อทุกอย่างที่รวมกันเป็นหนึ่งหรือนำหน้าการงาน -ถ้าการงานนั้นจะทำกันตามๆกันอย่างกรณีอิมามมัสยิดกลาง- จะเรียกว่า อุมมุน: أُمُّ เรียกหนังที่หุ้มสมองว่า อุมมุรเราะซิ:أُمُّ الرَّأْسِ (แม่สมอง) และเรียกแก่ผู้นำกองพลทหารและเป็นธงที่นำให้พวกเหล่าทหารทำงานร่วมกันว่า อุมุน (أُمًّ) แม่หรือแม่ทัพ ซูรุมมะฮฺได้กล่าวบทชะอีรฺบทหนึ่งว่า
            
            عَلَى رَأْسِهِ أُمٌّ لَنَا نَقْتَدِي بِهَا …. جِمَاعُ أُمُورٍ لَيْسَ نَعْصِي لَهَا أَمْرَا
            
            (บนหัวของเขาคือแม่ทัพของเรา เราทำตามเขา … ทุกการงาน เราไม่ฝ่าฝืนการกระทำนั้น)
            
            หมายถึง หอก
            
            และอิบนุญะรีรฺ ได้กล่าวอีกว่า ที่เรียกมักกะฮฺว่า อุมมุลกุรอ: أُمُّ الْقُرَى (แม่ของเมืองต่างๆ) เพราะเป็นเมืองที่นำหน้าทุกเมืองและรวมทุกเมือง และบางคนกล่าวว่าเพราะโลกเริ่มหมุนจากเมืองนี้
            
            บางคนกล่าวว่า ซูเราะฮฺนี้ที่เรียกว่า อัลฟาติหะฮฺ(การเปิด)เพราะเริ่มต้นอ่านอัลกุรอานด้วยซูเราะฮฺนี้ และอัลกุรอานที่บรรดาเศาะหาบะฮฺได้รวบรวมและบันทึกเป็นเล่มก็เริ่มด้วยซูเราะฮฺนี้
            
            การที่ซูเราะฮฺนี้ได้เรียกว่า อัลซับอะ อัลมะษานีย์: السَّبْع الْمَثَانِي (เจ็ดอายาตที่อ่านซ้ำๆ) ก็ถือว่าเป็นการเรียกที่ถูกต้อง พวกเขากล่าวว่า เพราะอ่านซ้ำในเวลาละหมาด อ่านซูเราะฮฺนี้ในทุกร็อกกะอะฮฺของเวลาละหมาด แม้ว่าคำว่า มะษานีย์ จะมีความหมายนอกจากความหมายนี้ ซึ่งเราจะรายละเอียดในเรื่องนี้ในหัวข้อของเรื่องนี้ อินชาอัลลอฮฺ
            
            อิมามอะหฺมัด อิบนุหัมบัล ได้กล่าวว่า ยะซีด อิบนุ ฮารูน ได้บอกว่าแก่เรา อุบนุอะบูซิอฺบุน ฮาชิม อิบนุ ฮาชิม ได้บอกแก่เราว่า อิบนุอะบูซิอฺบุน ได้รับรายงานจาก อัลมักบุรีย์ ว่า อะบูฮุร็อยเราะฮฺ ได้รายงาน ท่านนบี(ศ็อลฯ)ได้กล่าวเกี่ยวกับ อุมมุลกุรอาน ว่า
            
            ” هِيَ أُمّ الْقُرْآن وَهِيَ السَّبْع الْمَثَانِي وَهِيَ الْقُرْآن الْعَظِيم”
            
            (ซูเราะฮฺอัลฟาติหะฮฺ คือ อุมมุลกุรอาน คืออัลซับอะ อัลมะษานีและมันคืออัลกุรอานที่ยิ่งใหญ่)(อะหฺมัด,อัลมัซนัด :2/448)
            
            อิมามอะหฺมัด ได้รายงานอีกว่า อิสมาอีล อิบนุ อุมัรฺ ได้รับรายงานจาก อิบนุ อะบูซิอบุน ว่า อิบนุ อะบูซิอฺบุน ได้รับรายงานจาก อัลมักบุรีย์ ว่า อะบูฮุร็อยเราะฮฺ ได้รายงานว่า เราะซูลุลลอฮฺ(ศ็อลฯ)ได้กล่าวว่า
            
            ” هِيَ أُمّ الْقُرْآن وَهِيَ فَاتِحَة الْكِتَاب وَهِيَ السَّبْع الْمَثَانِي ”
            
            (ซูเราะฮฺอัลฟาติหะฮฺนี้อ คือ อุมมุลกุรอาน คือฟาติหะตุลกิตาม(การเปิดคัมภีร์) และอัซซับอะ อัลมะษานีย์(เจ็ดอายาตที่อ่านซ้ำๆ))
            
            อัลหาฟิซ อะบูบักรฺ อะหฺมัด อิบนุ มูซา อิบนุ มัรดะวัยฮฺ ได้กล่าวในอรรภาธิบายของเขาว่า อะหฺมัด อิบนุ ซิยาด ได้บอกแก่เราว่า มุหัมมัด อิบน ฆอลิบ อิบนุ หาริษได้เล่าให้เราฟังว่า อิซหาก อิบนุ อับดุลวาหิด อัลเมาศิลิย์ ได้เล่าให้เราฟังว่า อัลมุอาฟา อิบนุอิมรอน ได้เล่าให้เราฟังว่า อัลหะไมด์ อิบนุ ญะอฺฟัรฺ ได้รายงานว่า นูหฺ อิบนุ อะบูบิลาล ได้รายงานว่า อัลมักบุรีย์ ได้รายงานว่า อะบูฮุร็อยเราะฮฺ ได้กล่าว่า ท่านเราะซูลุลลอฮฺ(ศ็อลฯ)ได้กล่าวว่า
            
            ” الْحَمْد لِلَّهِ رَبّ الْعَالَمِينَ سَبْع آيَات : بِسْمِ اللَّه الرَّحْمَن الرَّحِيم إِحْدَاهُنَّ وَهِيَ السَّبْع الْمَثَانِي وَالْقُرْآن الْعَظِيم وَهِيَ أُمّ الْكِتَاب وَفَاتِحَة الْكِتَاب “
            
            (อัลหัมดุลิลลาฮิร็อบบิลอาละมีน(บรรดาการสรรเสริญเป็นของอัลลอฮฺผู้ทรงอภิบาลสากลโลก) 7 อายาต บิสมิลลาฮิรฺเราะฮฺมานิรฺเราะหีม(ด้วยพระนามของอัลลอฮฺผู้ทรงเมตตาปราณี) หนึ่งในนั้น เป็น อายาตที่อ่านซ้ำๆ เป็นอัลกุรอานที่ยิ่งใหญ่ เป็นอุมมุลกิตาบ(แม่ของคัมภีร์)และฟาติหะตุลกิตาบ(การเปิดของคัมภีร์))(อัลไบหะกีย์ :2/45)
            
            อัดดารุลกุฏนีย์ ได้รายงานเช่นกันว่า อะบูฮุร็อยเราะฮฺได้รายงานเป็นหะดีษมัรฺฟูอฺในลักษณะเช่นนี้เช่นกัน และอัดดารุลกุฏนีย์ได้ยืนยันว่าทุกคนที่รายงานหะดีษนี้เป็นคนที่มีความน่าเชื่อถือ(ษิเกาะฮฺ)(อัดดารุลกุฏนีย์ :1/312)
            
            อัลไบฮะกีย์ ได้รางานจาก อะลี, อิบนุอับบาซและอะบูฮุร็อยเราะฮฺ พวกเขาได้ให้ความเข้าใจในอายะฮฺอัลกุรอานที่ว่า سَّبْع الْمَثَانِي (เจ็ดอายาตที่ถูกอ่ายซ้ำๆ)(อัลหิจรฺ 15:87) หมายถึง ซูเราะฮฺอัลฟาติหะฮฺ (อัลไบหะกีย์ :2353) และบิสมิลลาฮิรฺเราะฮฺมานิรฺเราะหีม เห็นหนึ่งในอายาตนั้น ซึ่งจะพูดถึงอย่างครบถ้วนเมื่อเราพูดถึงในความหมายของอายะฮฺนี้
            
            อัลอะอฺมัชได้รายงานว่า รายงานว่าอิบรอฮีม ได้กล่าวว่า มีคนถามอิบนุมัซอูดว่า “ทำไมท่านไม่เขียนซูเราะฮฺ อัลฟาติหะฮฺ ในเล่มอัลกุรอานของท่าน?” อิบนุมัซอูด ตอบว่า “ถ้าฉันเขียนลงไป แน่นอนฉันต้องเขียนลงไปในทุกๆเริ่มต้นของซูเราะฮฺต่างๆ”
            
            อะบูบักรฺ อิบนุ อะบูดาวูด ได้กล่าวว่า หมายถึง เมื่อมีการอ่านในละหมาดแล้ว ก็เป็นการเพียงพอสำหรับมุสลิมที่จะต้องท่องซูเราะฮฺนี้ ไม่จำเป็นจะต้องเขียนบันทึกลงในเล่มอัลกุรอานอีก
            
            อัลบาเกาะลานี้ ได้คัดมาจากหนังสือ “ดะลาอิล อันนุบุววะฮฺ” ของอัลไบฮะกีย์ ว่า มีคนมีความเห็นว่าซูเราะฮฺอัลฟาติหะฮฺนี้ เป็นซูเราะฮฺในอัลกุรอานซูเราะฮฺแรกที่ประทานลง และเป็นหนึ่งในสามความเห็นที่กล่าวถึงซูเราะฮฺแรกที่ประทานลงมา และอีกความเห็นหนึ่ง กล่าวว่า ซูเราะฮฺแรกที่ประทานลงมา คือ ﴾يَا أَيّهَا الْمُدَّثِّر﴿[โอ้ผู้ห่มกายอยู่เอ๋ย !](อัลมุดดัษษีรฺ 74:1)อย่างที่กล่าวไว้ในหะดีษเศาะหีหฺที่รายงานโดย
            ญาบิรฺ
            
            ส่วนความเห็นที่สาม บางคนกล่าวซูเราะฮฺที่ถูกประทานลงมาซูเราะฮฺแรก คือ
            
            ﴿ٱقۡرَأۡ بِٱسۡمِ رَبِّكَ ٱلَّذِي خَلَقَ﴾
            
            (จงอ่านด้วยพระนามแห่งพระเจ้าของเจ้าผู้ทรงบังเกิด)(อัลอะลัก 96:1)
            
            ความเห็นนี้ถือว่าเป็นความเห็นที่ถูกต้องมากที่สุด ซึ่งรายละเอียดจะพูดในหัวข้อที่เกี่ยวกับเรื่องนี้
            
            วัลลอฮุมุซตะอาน(อัลลอฮฺทรงกรุณาให้ความช่วยเหลือ)
            
            —————————————————————
            
            [1] คัมภีร์ที่อัลลอฮฺใช้จดบันทึกทุกอย่างที่อัลลอฮฺได้ทรงให้บังเกิดขึ้น ที่กำลังเกิดและที่จะเกิดขึ้นในอนาคต
            
            [2] หะดีษมุรซัล (المُرْسَل) หมายถึง หะดีษที่ตาบีอีนเท่านั้นเป็นผู้รายงานว่ามาจากท่านเราะซูล(ศ็อลฯ)
            
            [3] ผู้รายงานเพียงคนเดียวตลอดสายรายงานหรือบางช่วงของสายรายงาน  หรือมีการรายงานแปลกกว่าคนอื่น
            
            [4] ชาษ์(شاذ)หรือผิดปกติ คือ รายงานขัดแย้งกับสายรายงานที่ดีกว่า','datasurah_id'=>'1']
            ]);    

    }
}
