<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class QurantafseerSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        \DB::table('qurantafseers')->delete();

        \DB::table('qurantafseers')->insert([
            ['id'=>'1','name'=>'อธิบาย ซูเราะห์อัลฟาตีฮะ','qurantafseer'=>'คือวันปรโลก อันเป็นวันที่มนุษย์พื้นคืนชีพขึ้นมาเพื่อรับการตอบแทน
            ','arabic_id'=>'4','resource'=>'หนังสือพระมหาคัมภีร์อัลกุรอาน พร้อมคำแปลภาษาไทย  ','status'=>'อนุมัติ','user_id'=>'1','datasurah_id'=>'1','created_at'=>null,'updated_at'=>'2021-11-24 15:39:08'],
            ['id'=>'2','name'=>'อธิบาย ซูเราะห์อัลฟาตีฮะ','qurantafseer'=>'คือมอบการเคารพอิบาตะทุกประเภทให้แก่พระองค์  แต่เพียงองค์เดียวเท่านั้น โดยปราศจากการให้
            ผู้หนึ่งผู้ใด หรือสิ่งหนึ่งสิ่งใดมีหุ้นส่วนในการอิบาดะดังกล่าว เป็นต้นว่า การวังวอนขอความช่วยเหลือ
            การบน การสานาน และการเชือด ฯลฯ
            ขอความช่วยเหลือในสิ่งที่อยู่นอกเหนือกฎสภาวการณ์ หรือสิ่งที่ไม่อยู่ในความสามารถของมนุษย์ที่จะให้
            ความช่วยเหลือได้','arabic_id'=>'5','resource'=>'หนังสือพระมหาคัมภีร์อัลกุรอาน พร้อมคำแปลภาษาไทย  ','status'=>'อนุมัติ','user_id'=>'1','datasurah_id'=>'1','created_at'=>null,'updated_at'=>'2021-11-24 15:39:08'],
            ['id'=>'3','name'=>'อธิบาย ซูเราะห์อัลฟาตีฮะ','qurantafseer'=>'หมายถึงพวกยิว เพราะพวกเขาประพฤติตนฝ่าฝืนบัญญัติของอัลลออยู่เสมอ และหมายถึงผู้ที่มี
            พฤติการณ์ในทำนองเดียวกันนั้นด้วย
            หมายถึงพวกคริสเตียนเพราะพวกเซาหลงผิดไปว่า นะบี อีซา เป็นบุตรของอัลลอฮฺ เนื่องจากนะบีอีซา
            เกิดจากนางมัรยัม ซึ่งเป็นหญิงบริสุทธิ์ ปราสจากชายใดสมสู่นาง แต่ความจริงนั้นนะบีอีซาหาใช่เป็น
            พระบุตรของพระองค์ไม่ หากแต่เป็นบ่าวของพระองค์คนหนึ่งเช่นเดียวกับบ่าวของพระองค์ทั้งหลาย
            จะแตกต่างกันก็เพียงแต่ว่า นะบีอีชานั้นเกิดจากนางมัรยัมแต่ฝ่ายเดียว โดยไม่มีขายใดสมสู่นางเยี่ยง
            หญิงอื่น ๆ ทั้งนี้ด้วยประกาศิตของพระองค์ ดังกล่าวนี้เป็นการชี้แจงของพระองค์ไว้ในอัล-กุรอาน','arabic_id'=>'7','resource'=>'หนังสือพระมหาคัมภีร์อัลกุรอาน พร้อมคำแปลภาษาไทย  ','status'=>'อนุมัติ','user_id'=>'1','datasurah_id'=>'1','created_at'=>null,'updated_at'=>'2021-11-24 15:39:08']
            
            ]);    

    }
}
