<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class QurantafseerSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        \DB::table('qurantafseers')->delete();

        \DB::table('qurantafseers')->insert([
            ['id'=>'1','name'=>'ตัฟซีรฺอิบนุกะษีรฺ => 1.ซูเราะฮฺ อัลฟาติหะฮฺ','qurantafseer'=>'(4)คือวันปรโลก อันเป็นวันที่มนุษย์พื้นคืนชีพขึ้นมาเพื่อรับการตอบแทน
            (5)คือมอบการเคารพอิบาตะทุกประเภทให้แก่พระองค์  แต่เพียงองค์เดียวเท่านั้น โดยปราศจากการให้
            ผู้หนึ่งผู้ใด หรือสิ่งหนึ่งสิ่งใดมีหุ้นส่วนในการอิบาดะดังกล่าว เป็นต้นว่า การวังวอนขอความช่วยเหลือ
            การบน การสานาน และการเชือด ฯลฯ
            (5)ขอความช่วยเหลือในสิ่งที่อยู่นอกเหนือกฎสภาวการณ์ หรือสิ่งที่ไม่อยู่ในความสามารถของมนุษย์ที่จะให้
            ความช่วยเหลือได้
            (7)หมายถึงพวกยิว เพราะพวกเขาประพฤติตนฝ่าฝืนบัญญัติของอัลลออยู่เสมอ และหมายถึงผู้ที่มี
            พฤติการณ์ในทำนองเดียวกันนั้นด้วย
            (7)หมายถึงพวกคริสเตียนเพราะพวกเซาหลงผิดไปว่า นะบี อีซา เป็นบุตรของอัลลอฮฺ เนื่องจากนะบีอีซา
            เกิดจากนางมัรยัม ซึ่งเป็นหญิงบริสุทธิ์ ปราสจากชายใดสมสู่นาง แต่ความจริงนั้นนะบีอีซาหาใช่เป็น
            พระบุตรของพระองค์ไม่ หากแต่เป็นบ่าวของพระองค์คนหนึ่งเช่นเดียวกับบ่าวของพระองค์ทั้งหลาย
            จะแตกต่างกันก็เพียงแต่ว่า นะบีอีชานั้นเกิดจากนางมัรยัมแต่ฝ่ายเดียว โดยไม่มีขายใดสมสู่นางเยี่ยง
            หญิงอื่น ๆ ทั้งนี้ด้วยประกาศิตของพระองค์ ดังกล่าวนี้เป็นการชี้แจงของพระองค์ไว้ในอัล-กุรอาน','translator_name'=>'หนังสือพระมหาคัมภีร์อัลกุรอาน พร้อมคำแปลภาษาไทย  ','datasurah_id'=>'1'],
            ['id'=>'2','name'=>'ตัฟซีรซูเราะห์อัลบากอเราะห์ อายะห์ที่1 และ 3','qurantafseer'=>'(1)คำนี้มิใช่เป็นศัพท์ที่ถูกกำหนดให้มีความหมายดังเช่นคำอื่น ๆ หากแต่เป็นพยัญชนะโตดๆ ซึ่งถูก
            นำมารวมกัน เพื่อให้อ่านออกเสียงพยัญชนะเหล่านี้ต่อเนื่องกัน ด้วยเหตุนี้เราจึงต้องอ่านออกเสียง
            คำนี้เป็นพยัญชนะโดด ๆ ว่า อะลิฟ ลาม มีม ส่วนความมุ่งหมายอันแท้จริงของคำนี้และคำอื่น ๆ ที่
            คล้ายคลึงกัน เช่น อะลิฟ ลาม รอเป็นต้นนั้น ไม่มีใครสามารถเข้าใจได้ เพราะท่านนะบีมิได้
            อธิบายไว้ แต่กระนั้นก็ยังมีนักปราชญ์บางท่านพยายามหาความเข้าใจ โดยนำพยัญชนะอื่น ๆ มา
            ประกอบเพื่อให้มีความหมายในการนี้ย่อมทำให้ความหมายของแต่ละพยัญชนะแตกต่างกันไป ซึ่งไม่
            เป็นที่ยึดถือได้ ยังมีอีกทรรศนะหนึ่งของนักปราชญ์บางท่านว่า พยัญชนะเหล่านี้ถูกนำมาระบุไว้ใน
            ตอนตันซอง ซูเราะฮฺ เพื่อเตือนผู้คนให้หันมาสนใจ และสดับฟังโองการซองอัลลอฮฺที่จะอ่านให้ฟังต่อไป
            คล้ายกับคำที่ใช้เดือนให้เตรียมตัวว่า หนึ่ง สอง สาม กระนั้น นี่ก็เป็นเพียงทรรศนะซองนักปราชญ์
            ที่ต้องการจะให้ความหมาย แต่ความหมายที่แท้จริงนั้นไม่มีใครสามารถจะรู้ได้ ดังที่ได้กล่าวมาแล้ว
            (3)หมายถึงสิ่งที่พ้นญาณวิสัยของมนุษย์ เช่น อัตตะของอัลลอฮฺ มลาอิกะฮของพระองค์ และสภาพของปรโลก
            ตลอดจนการสอบสวนของ มุงกัร และนะกีรุ แก่ผู้ที่เสียชีวิตไม่ว่าจะถูกฝังไว้ในสุสานหรือถูกเก็บไว้ใน
            ที่อื่นใดก็ตาม พร้อมด้วยการตอบแทน และลงโทษบุคคลเหล่านั้นในเบื้องต้นก่อนด้วย','translator_name'=>'หนังสือพระมหาคัมภีร์อัลกุรอาน พร้อมคำแปลภาษาไทย  ','datasurah_id'=>'2'],
            ['id'=>'3','name'=>'อธิบายสูเราะฮฺ อัล-ฟาติหะฮฺ\r\n','qurantafseer'=>'ด้วยพระนามของอัลลอฮฺ ผู้ทรงเมตตา ปรานียิ่งเสมอ
            
            อธิบายสูเราะฮฺ อัล-ฟาติหะฮฺ
             
            มวลการสรรเสริญเป็นสิทธิแห่งเอกองค์อัลลอฮฺพระผู้อภิบาลแห่งสากลโลก ความจำเริญและความศานติจงประสบแด่ท่านนบีมุหัมมัดของเรา รวมถึงวงศ์วานของท่านและเหล่าสาวกของท่านทั้งมวล ข้าพเจ้าขอปฏิญาณว่าไม่มีพระเจ้าอื่นใดที่ต้องเคารพภักดีนอกจากอัลลอฮฺผู้เดียวโดยไม่มีภาคีใดๆ ร่วมกับพระองค์ และขอปฏิญาณว่ามุหัมมัดเป็นบ่าวและศาสนทูตของพระองค์ 
            อนึ่ง แท้จริงแล้วในบรรดาสูเราะฮฺต่างๆ ของอัลกุรอานอันยิ่งใหญ่ที่เราอ่านกันทุกวันในละหมาด ทั้งที่เป็นฟัรฎูและสุนัต คือสูเราะฮฺ อัล-ฟาติหะฮฺ มันคือสูเราะฮฺที่ยิ่งใหญ่ที่สุดในบรรดาสูเราะฮฺต่างๆ ของอัลกุรอาน มีบันทึกโดยอัล-บุคอรีย์จากหะดีษของ อบู สะอีด บิน อัล-มุอัลลา เราะฎิยัลลอฮุอันฮุ กล่าวว่า 
            كُنْتُ أُصَلِّي فِي الْمَسْجِدِ فَدَعَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَلَمْ أُجِبْهُ، فَقُلْتُ => يَا رَسُولَ اللَّهِ، إِنِّي كُنْتُ أُصَلِّي، فَقَالَ=> «أَلَمْ يَقُلْ اللَّهُ ﴿اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ لِمَا يُحْيِيكُمْ﴾»، ثُمَّ قَالَ لِي => «لَأُعَلِّمَنَّكَ سُورَةً هِيَ أَعْظَمُ السُّوَرِ فِي الْقُرْآنِ قَبْلَ أَنْ تَخْرُجَ مِنْ الْمَسْجِدِ»، ثُمَّ أَخَذَ بِيَدِي، فَلَمَّا أَرَادَ أَنْ يَخْرُجَ، قُلْتُ لَهُ=> أَلَمْ تَقُلْ لَأُعَلِّمَنَّكَ سُورَةً هِيَ أَعْظَمُ سُورَةٍ فِي الْقُرْآنِ، قَالَ=> ﴿الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ﴾ هِيَ السَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُوتِيتُهُ». 
            ความว่า  ครั้งหนึ่ง ขณะที่ฉันละหมาดอยู่ในมัสยิด แล้วท่านเราะสูล ศ็อลลัลลอฮุอะลัยฮิวะสัลลัม ก็ได้เรียกฉัน แต่ฉันก็ไม่ได้ขานรับท่าน เมื่อฉันเสร็จจากละหมาดฉันก็ได้กล่าวว่า โอ้ ท่านเราะสูลุลลอฮฺ แท้จริง ตอนที่ท่านเรียกนั้นฉันกำลังละหมาดอยู่ ท่านกล่าวว่า อัลลอฮฺไม่ได้ตรัสดอกหรือว่า 
            ﴿اسْتَجِيبُواْ لِلّهِِ وَلِلرَّسُولِ إِذَا دَعَاكُم لِمَا يُحْيِيكُمْ﴾ (الأنفال => 24 )
            ความว่า จงขานรับต่ออัลลอฮฺและศาสนทูต เมื่อเขาได้เรียกพวกเจ้าสู่สิ่งที่ให้ชีวิตแก่พวกเจ้าเอง' ]
            ]);    

    }
}
