<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class ThaiSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        \DB::table('thais')->delete();

        \DB::table('thais')->insert([


['id'=>'1','datasurah_id'=>'1','ayat'=>'1','Text'=>'ด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ','audio'=>'001001.mp3','tafseer'=>'0x','status'=>'อนุมัติ','created_at'=>null,'updated_at'=>'2021-11-23 09=>13=>14'],
['id'=>'2','datasurah_id'=>'1','ayat'=>'2','Text'=>'การสรรเสริญทั้งหลายนั้น เป็นสิทธิของอัลลอฮฺผู้เป็นพระเจ้าแห่งสากลโลก','audio'=>'001002.mp3','tafseer'=>'0x','status'=>'อนุมัติ','created_at'=>null,'updated_at'=>null],
['id'=>'3','datasurah_id'=>'1','ayat'=>'3','Text'=>'ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ','audio'=>'001003.mp3','tafseer'=>'0x','status'=>'อนุมัติ','created_at'=>null,'updated_at'=>null],
['id'=>'4','datasurah_id'=>'1','ayat'=>'4','Text'=>'ผู้ทรงอภิสิทธิ์แห่งวันตอบแทน','audio'=>'001004.mp3','tafseer'=>'คือวันปรโลก อันเป็นวันที่มนุษย์พื้นคืนชีพขึ้นมาเพื่อรับการตอบแทน','status'=>'อนุมัติ','created_at'=>null,'updated_at'=>null],
['id'=>'5','datasurah_id'=>'1','ayat'=>'5','Text'=>'เฉพาะพระองค์เท่านั้นที่พวกข้าพระองค์เคารพอิบาดะฮฺ และเฉพาะพระองค์เท่านั้นที่พวกข้าพระองค์ขอความช่วยเหลือ','audio'=>'001005.mp3','tafseer'=>'คือมอบการเคารพอิบาตะทุกประเภทให้แก่พระองค์  แต่เพียงองค์เดียวเท่านั้น โดยปราศจากการให้
ผู้หนึ่งผู้ใด หรือสิ่งหนึ่งสิ่งใดมีหุ้นส่วนในการอิบาดะดังกล่าว เป็นต้นว่า การวังวอนขอความช่วยเหลือ
การบน การสานาน และการเชือด ฯลฯ
ขอความช่วยเหลือในสิ่งที่อยู่นอกเหนือกฎสภาวการณ์ หรือสิ่งที่ไม่อยู่ในความสามารถของมนุษย์ที่จะให้
ความช่วยเหลือได้ ','status'=>'อนุมัติ','created_at'=>null,'updated_at'=>null],
['id'=>'6','datasurah_id'=>'1','ayat'=>'6','Text'=>'ขอพระองค์ทรงแนะนำพวกข้าพระองค์ซึ่งทางอันเที่ยงตรง','audio'=>'001006.mp3','tafseer'=>'0x20','status'=>'อนุมัติ','created_at'=>null,'updated_at'=>null],
['id'=>'7','datasurah_id'=>'1','ayat'=>'7','Text'=>'(คือ) ทางของบรรดาผู้ที่พระองค์ได้ทรงโปรดปราณแก่พวกเขา มิใช่ในทางของพวกที่ถูกกริ้ว และมิใช่ทางของพวกที่หลงผิด','audio'=>'001007.mp3','tafseer'=>'หมายถึงพวกยิว เพราะพวกเขาประพฤติตนฝ่าฝืนบัญญัติของอัลลออยู่เสมอ และหมายถึงผู้ที่มี
พฤติการณ์ในทำนองเดียวกันนั้นด้วย
หมายถึงพวกคริสเตียนเพราะพวกเซาหลงผิดไปว่า นะบี อีซา เป็นบุตรของอัลลอฮฺ เนื่องจากนะบีอีซา
เกิดจากนางมัรยัม ซึ่งเป็นหญิงบริสุทธิ์ ปราสจากชายใดสมสู่นาง แต่ความจริงนั้นนะบีอีซาหาใช่เป็น
พระบุตรของพระองค์ไม่ หากแต่เป็นบ่าวของพระองค์คนหนึ่งเช่นเดียวกับบ่าวของพระองค์ทั้งหลาย
จะแตกต่างกันก็เพียงแต่ว่า นะบีอีชานั้นเกิดจากนางมัรยัมแต่ฝ่ายเดียว โดยไม่มีขายใดสมสู่นางเยี่ยง
หญิงอื่น ๆ ทั้งนี้ด้วยประกาศิตของพระองค์ ดังกล่าวนี้เป็นการชี้แจงของพระองค์ไว้ในอัล-กุรอาน','status'=>'อนุมัติ','created_at'=>null,'updated_at'=>null],
['id'=>'8','datasurah_id'=>'2','ayat'=>'1','Text'=>'อะลิฟ ลาม มีม','audio'=>'002001.mp3','tafseer'=>'คำนี้มิใช่เป็นศัพท์ที่ถูกกำหนดให้มีความหมายดังเช่นคำอื่น ๆ หากแต่เป็นพยัญชนะโตดๆ ซึ่งถูก นำมารวมกัน เพื่อให้อ่านออกเสียงพยัญชนะเหล่านี้ต่อเนื่องกัน ด้วยเหตุนี้เราจึงต้องอ่านออกเสียง คำนี้เป็นพยัญชนะโดด ๆ ว่า อะลิฟ ลาม มีม ส่วนความมุ่งหมายอันแท้จริงของคำนี้และคำอื่น ๆ ที่ คล้ายคลึงกัน เช่น อะลิฟ ลาม รอเป็นต้นนั้น ไม่มีใครสามารถเข้าใจได้ เพราะท่านนะบีมิได้ อธิบายไว้ แต่กระนั้นก็ยังมีนักปราชญ์บางท่านพยายามหาความเข้าใจ โดยนำพยัญชนะอื่น ๆ มา ประกอบเพื่อให้มีความหมายในการนี้ย่อมทำให้ความหมายของแต่ละพยัญชนะแตกต่างกันไป ซึ่งไม่ เป็นที่ยึดถือได้ ยังมีอีกทรรศนะหนึ่งของนักปราชญ์บางท่านว่า พยัญชนะเหล่านี้ถูกนำมาระบุไว้ใน ตอนตันซอง ซูเราะฮฺ เพื่อเตือนผู้คนให้หันมาสนใจ และสดับฟังโองการซองอัลลอฮฺที่จะอ่านให้ฟังต่อไป คล้ายกับคำที่ใช้เดือนให้เตรียมตัวว่า หนึ่ง สอง สาม กระนั้น นี่ก็เป็นเพียงทรรศนะซองนักปราชญ์ ที่ต้องการจะให้ความหมาย แต่ความหมายที่แท้จริงนั้นไม่มีใครสามารถจะรู้ได้ ดังที่ได้กล่าวมาแล้ว','created_at'=>null,'updated_at'=>null],
['id'=>'9','datasurah_id'=>'2','ayat'=>'2','Text'=>'คัมภีร์นี้ ไม่มีความสงสัยใด ๆ ในนั้น เป็นคำแนะนำสำหรับบรรดาผู้ยำเกรงเท่านั้น','audio'=>'002002.mp3','tafseer'=>'0x','status'=>'อนุมัติ','created_at'=>null,'updated_at'=>null],
['id'=>'10','datasurah_id'=>'2','ayat'=>'3','Text'=>'คือบรรดาผู้ศรัทธาต่อสิ่งเร้นลับ และดำรงไว้ซึ่งการละหมาด และส่วนหนึ่งจากสิ่งที่เราได้ให้เป็นปัจจัยยังชีพแก่พวกเขานั้น พวกเขาก็บริจาค','audio'=>'002003.mp3','tafseer'=>'หมายถึงสิ่งที่พ้นญาณวิสัยของมนุษย์ เช่น อัตตะของอัลลอฮฺ มลาอิกะฮของพระองค์ และสภาพของปรโลก ตลอดจนการสอบสวนของ มุงกัร และนะกีรุ แก่ผู้ที่เสียชีวิตไม่ว่าจะถูกฝังไว้ในสุสานหรือถูกเก็บไว้ใน ที่อื่นใดก็ตาม พร้อมด้วยการตอบแทน และลงโทษบุคคลเหล่านั้นในเบื้องต้นก่อนด้วย','status'=>'อนุมัติ','created_at'=>null,'updated_at'=>null],

            
            ]);
            }
            }
            

