@extends('quran.navbar')

   <style>
.t {
  background-color: white;
  color: black;
  font-family:  serif;
        font-size: 15px;
        font-weight: normal;
        direction: rtl;
        padding: 0;
        margin: 0;
}
@font-face {
    font-family: quran-font;
    font-style: normal;
    font-weight: 400;
    src: url('assets/font/AmiriQuranColored.woff') format('truetype');
  }
  
  .quran-font {
    font-family: quran-font;
    font-size: 26px;
    color: black;
  }
  .ayat{
     font-family: quran-font;
     direction: rtl;
     font-size: 26px;
     line-height: 200%;
     color: black;
   }
   .ayat .kalimah{
    font-family: quran-font;
     direction: rtl;
     font-size: 26px;
     line-height: 200%;
     color: green;
   }
   .highlight{ 
  background:black; 
  padding:1px; 
  border:#00CC00 dotted 1px; 
}
   .title{
    text-align: center;

}
</style>
<br>
    <br>
 <div style = background-color:white; class="search-area">
 <div class="row">
    <div class="col-md-8 mx-auto">
<br>

   
        <h1 class="title">คำที่ควรสังเกตในอัลกุรอาน</h1>
        <br>
        
        <div class="ayat"><p>وَٱللَّهُ يَقْبِضُ <span class="kalimah">وَيَبْصُۜطُ</span> وَإِلَيْهِ تُرْجَعُونَ </p></div>
        <p class="t">พยัญชนะขึ้นที่อยู่บนพยัญชนะสอด จะอ่านด้วยพยัญชนะขึ้นอย่างเดียว</p>
        <p>(อัล-บะเกาะเราะฮ : 245)</p>
        <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
        
      <div class="ayat"><p></span> أَمْ عِندَهُمْ خَزَآئِنُ رَبِّكَ أَمْ هُمُ<span class="kalimah"> ٱلْمُصَۣيْطِرُونَ </span></p></div>
        <p class="t">พยัญชนะซีนที่อยู่ล่างพยัญชนะศอด จะอ่านด้วยพยัญชนะขึ้นหรือสอดก็ได้</p>
        <p>(อัฏ-ฏูร : 37)</p>
        <br>
      <audio controls >
      <source src="114001.mp3" type="audio/mpeg">
      </audio>
      <br>
        
        
        <div class="ayat"><p> فَإِنْ أَمِنَ بَعْضُكُم بَعْضًا فَلْيُؤَدِّ الَّذِي <span class="kalimah">اؤْتُمِنَ</span> أَمَانَتَهُ وَلْيَتَّقِ اللَّهَ رَبَّهُ </p></div>
        <p class="t">อ่านว่า อูตูมีนา ถ้าเริ่มอ่านจากคำนี้จะอ่านฮัมซะฮฺแรกฎอมมะอฺ ฮัมซะฮฺ ที่สองเป็นสกูน</p>
        <p>(อัล-บะเกาะเราะฮ : 283)</p>
        <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
        
         
        <div class="ayat"><p>الٓمٓ(١) ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ (٢)</p></div>
        <p class="t">เวลาอ่านต่อเนื่องจาก 2 คำนี้จะอ่าน มีม สระฟัตฮะฮฺ แต่ยายกับทีมนั้น อ่านได้ 2 แบบ ดังนี้ 
           <br> 
           อ่านยาวตามตัวเดิม 6 ฮารอกะฮฺ -อ่านสั้นเหมือนมัดดุเฏาะบีอีย 2 ฮารอกะฮฺ</p>
        <p>(อัล-อิมรอน : 1-2)</p>
        <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
        
        
        <div class="ayat"><p>ثَمَانِيَةَ أَزْوَاجٍ مِّنَ الضَّأْنِ اثْنَيْنِ وَمِنَ الْمَعْزِ اثْنَيْنِ قُلْ آلذَّكَرَيْنِ حَرَّمَ أَمِ الْأُنثَيَيْنِ أَمَّا اشْتَمَلَتْ عَلَيْهِ أَرْحَامُ الْأُنثَيَيْنِ نَبِّئُونِي بِعِلْمٍ إِن كُنتُمْ صَادِقِينَ ( 143 )    وَمِنَ الْإِبِلِ اثْنَيْنِ وَمِنَ الْبَقَرِ اثْنَيْنِ قُلْ آلذَّكَرَيْنِ حَرَّمَ أَمِ الْأُنثَيَيْنِ  </p></div>
        <p class="t">จะอ่านฮัมซะฮวาสัลตรงนี้ได้ 2 แบบ 1 อ่านแบบมัดบาดัล อ่านยาว 6 ฮารอกะฮฺ 2 อ่านแบบตัสฮีล คือ ออกเสียงฮัมเซาะฮฺที่สองระหว่างอลิฟกับฮัมเซาะฮฺ 2 ฮารอกะฮฺ</p>
        <p>(อัล-อันอาม : 143-144)</p>
        <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
        
       
       
        <div class="ayat"><p> أَوَعَجِبْتُمْ أَن جَآءَكُمْ ذِكْرٌۭ مِّن رَّبِّكُمْ عَلَىٰ رَجُلٍۢ مِّنكُمْ لِيُنذِرَكُمْ ۚ وَٱذْكُرُوٓا۟ إِذْ جَعَلَكُمْ خُلَفَآءَ مِنۢ بَعْدِ قَوْمِ نُوحٍۢ وَزَادَكُمْ فِى ٱلْخَلْقِ بَصْۜطَةًۭ ۖ فَٱذْكُرُوٓا۟ ءَالَآءَ ٱللَّهِ لَعَلَّكُمْ تُفْلِحُونَ ٦٩</p></div>
        <p class="t">การออกเสียงซีนอย่างเดียว</p>
        <p>(อัล-อะอฺรอฟ : 69)</p>
        <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
        
        
       
        <div class="ayat"><p>وَٱلَّذِينَ يُمَسِّكُونَ بِٱلْكِتَـٰبِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ إِنَّا لَا نُضِيعُ أَجْرَ ٱلْمُصْلِحِينَ ١٧٠ </p></div>
        <p class="t">อ่านมีมสระฟัตฮะฮฺเเละซีนมีซัดดะฮฺ</p>
        <p>(อัล-อะอฺรอฟ : 170)</p>
        <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
        
        
        <div class="ayat"><p>إِنَّ وَلِيِّيَ اللَّهُ الَّذِي نَزَّلَ الْكِتَابَ وَهُوَ يَتَوَلَّى الصَّالِحِينَ (196 ) </p></div>
        <p class="t">เป็นมัดตัมกีน อ่าน 2 ฮารอกะฮฺ</p>
        <p>(อัล-อะอฺรอฟ : 196)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
        
        
        <p> การอ่านท้ายสูเราะฮฺอัลอันฟาลกับต้นสูเราะฮฺอัตเตาบะฮฺ</p>
        <div class="ayat"><p>هِ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ ( 75 )  بَرَآءَةٌۭ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلَّذِينَ عَـٰهَدتُّم مِّنَ ٱلْمُشْرِكِينَ (1)</p></div>
        <p class="t">อ่านต่อเนื่องท้ายสูเราะฮฺอัลอันฟาลกับต้นสูเราะฮฺอัตเตาบะฮฺ ได้ 3 แบบ 1.อ่านหยุดพร้อมหายใจ  2.อ่านสักตะฮฺไม่หายใจ  3.อ่านต่อเนื่องพร้อมหน่วงเสียง</p>
        <p>(อัล-อันฟาล : 75),(อัตเตาบะฮฺ : 1)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
        


        <div class="ayat"><p> قُلْ هَلْ مِن شُرَكَآئِكُم مَّن يَهْدِىٓ إِلَى ٱلْحَقِّ ۚ قُلِ ٱللَّهُ يَهْدِى لِلْحَقِّ ۗ أَفَمَن يَهْدِىٓ إِلَى ٱلْحَقِّ أَحَقُّ أَن يُتَّبَعَ أَمَّن لَّا يَهِدِّىٓ إِلَّآ أَن يُهْدَىٰ ۖ فَمَا لَكُمْ كَيْفَ تَحْكُمُونَ(35)</p></div>
        <p class="t">อ่านหยุดที่คำนี้เป็นกอลกอลาฮฺกุบรอ</p>
        <p>(ยูนุส : 35)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
        

        <div class="ayat"><p> </p></div>
        <p class="t"></p>
        <p>(อัล-อะอฺรอฟ : 69)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
        
        
        <div class="ayat"><p> </p></div>
        <p class="t"></p>
        <p>(อัล-อะอฺรอฟ : 69)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
         
        

         
      <div class="ayat"><p> ثُمَّ إِذَا مَا وَقَعَ ءَامَنتُم بِهِۦٓ ۚ ءَآلْـَٔـٰنَ وَقَدْ كُنتُم بِهِۦ تَسْتَعْجِلُونَ  51  <br>ءَآلْـَٔـٰنَ وَقَدْ عَصَيْتَ قَبْلُ وَكُنتَ مِنَ ٱلْمُفْسِدِينَ(91)</p></div>
        <p class="t">สามารถอ่านได้ 2 แบบ <br> 1-อ่านยาว6ฮารอกะฮ 2- ออกเสียงฮัมเซาะฮวาลระหว่างฮัมเซาะฮฺกับอลิฟ</p>
        <p>( ยูนุส:51,91)</p> <br> 
      <audio controls >
      <source src="" type="">
      </audio>
      <br>

        
        <div class="ayat" >  <p>قُلْ أَرَءَيْتُم مَّآ أَنزَلَ ٱللَّهُ لَكُم مِّن رِّزْقٍۢ فَجَعَلْتُم مِّنْهُ حَرَامًۭا وَحَلَـٰلًۭا قُلْ ءَآللَّهُ أَذِنَ لَكُمْ ۖ أَمْ عَلَى ٱللَّهِ تَفْتَرُونَ</p>
        <p<p></div>
        <p class="t">จะอ่านฮัมซะฮฺวาสัลตรงนี้ได้ 2 แบบ <br>
         1อ่านยาว 6 บารอกะฮฺ 2 ออกเสียงฮัมเซาะฮฺที่สองระหว่างอลิฟกับฮัมเซาะฮฺ</p>
        <p>( :)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
       
      <div class="ayat"><p><p> وَقَالَ ٱرْكَبُوا۟ فِيهَا بِسْمِ ٱللَّهِ مَجْر۪ىٰهَا وَمُرْسَىٰهَآ ۚ إِنَّ رَبِّى لَغَفُورٌۭ رَّحِيمٌۭ <br> وَهِىَ تَجْرِى بِهِمْ فِى مَوْجٍۢ كَٱلْجِبَالِ وَنَادَىٰ نُوحٌ ٱبْنَهُۥ وَكَانَ فِى مَعْزِلٍۢ يَـٰبُنَىَّ ٱرْكَب مَّعَنَا وَلَا تَكُن مَّعَ ٱلْكَـٰفِرِينَ</p></div>
        <p class="t">คำนี้จะออกเสียงเป็น มัจ-เร-ฮา</p>
        <p>( ฮูด : 41,42)</p><br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
   
       
        <div class="ayat"> <p> يَـٰبُنَىَّ ٱرْكَب مَّعَنَا وَلَا تَكُن مَّعَ ٱلْكَـٰفِرِينَ </div>
        <p class="t">พยัญชนะบาอฺกับมีมตรงนี้ ต้องอิดฆอมให้สมบูรณ์พร้อมขัดดะฮฺ</p>
        <p>( ฮูด:42)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>

        <div class="ayat"><p>مَعْزِلٍۢ يَـٰبُنَىَّ ٱرْكَب مَّعَنَا وَلَا تَكُن مَّعَ ٱلْكَـٰفِرِينَ </div>
        <p class="t">พยัญชนะบาอฺกับมีมตรงนี้ ต้องอิดฆอมให้สมบูรณ์พร้อมขัดดะฮฺ</p>
        <p>( มัรยัม:1)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>

        <div class="ayat"><p>قَالُواْ  يَٰٓأَبَانَا  مَا  لَكَ  لَا  تَأۡمَ۬نَّا  عَلَىٰ  يُوسُفَ  وَإِنَّا  لَهُۥ  لَنَٰصِحُونَ</div>
        <p class="t">อ่านได้ 2 แบบ 1. อ่านว่า ตะ-มา-นู-นา 2. อ่านว่า ตะ-มัน........นาน โดยยื่นริมฝีปากพร้อมหน่วงเสียง</p>
        <p>( ยูซุฟ:11)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>

        <div class="ayat"><p >ٱلۡحَمۡدُ  لِلَّهِ  ٱلَّذِيٓ  أَنزَلَ  عَلَىٰ  عَبۡدِهِ  ٱلۡكِتَٰبَ  وَلَمۡ  يَجۡعَل  لَّهُۥ  عِوَجَاۜ  <br> قَيِّمٗا  لِّيُنذِرَ  بَأۡسٗا  شَدِيدٗا  مِّن  لَّدُنۡهُ  وَيُبَشِّرَ  ٱلۡمُؤۡمِنِينَ  ٱلَّذِينَ  يَعۡمَلُونَ  ٱلصَّٰلِحَٰتِ  أَنَّ  لَهُمۡ  أَجۡرًا  حَسَنٗا   </p></div>
        <p class="t">อ่านต่อเนื่องเป็นสักตะฮฺ</p>
        <p>( อัล-กะฮฺฟ์:1)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>

        <div class="ayat"><p>إِنَّ ٱلَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ ٱللَّهَ يَدُ ٱللَّهِ فَوْقَ أَيْدِيهِمْ ۚ فَمَن نَّكَثَ فَإِنَّمَا يَنكُثُ عَلَىٰ نَفْسِهِۦ ۖ وَمَنْ أَوْفَىٰ بِمَا عَـٰهَدَ عَلَيْهُ ٱللَّهَ فَسَيُؤْتِيهِ أَجْرًا عَظِيمًۭا</p></div>
        <p class="t">อ่านฮาอฺสระฏอมมะฮฺ</p>
        <p>(  อัล-ฟัตห์:1)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
        
        <div class="ayat"><p>كٓهيعٓصٓ</div>
        <p class="t">พยัญชนะอัยน์ สามารถอ่านได้ 2 แบบ 
          <br>1- อ่านยาว 6 ฮารอกะฮฺ 2- อ่านปานกลาง 4 ฮารอกะฮฺ</p>
        <p>( มัรยัม:1)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>

        <p>18.</p>
        <p>อัล-ฟุรกอน(38)وَعَادًا وَثَمُودَ وَأَصْحَابَ الرَّسِّ وَقُرُونًا بَيْنَ ذَٰلِكَ كَثِيرً </p>
        
      
        <div class="ayat"><p> كَذَّبَ  أَصۡحَٰبُ  لۡـَٔيۡكَةِ  ٱلۡمُرۡسَلِينَ </p></div>
        <p class="t"> เริ่มอ่านด้วยอัมเซาะฮฺสระฟัตฮะเพื่อสามารถอ่านด้วยลามสูกุน</p>
        <p>( อัซ-ซุอารออฺ:176)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>

    
        <div class="ayat"><p> طسٓۚ  تِلۡكَ  ءَايَٰتُ  ٱلۡقُرۡءَانِ  وَكِتَابٖ  مُّبِينٍ</p></div>
        <p class="t">เมื่ออ่านต่อเนื่องจะซ่อนนูนที่ตาอฺ</p>
        <p>(อัน-นะห์ลฺ :22)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>

      <div class="ayat"><p> فَلَمَّا  جَآءَ  سُلَيۡمَٰنَ  قَالَ  أَتُمِدُّونَنِ  بِمَالٖ  فَمَآ  ءَاتَىٰنِۦَ  ٱللَّهُ  خَيۡرٞ  مِّمَّآ  ءَاتَىٰكُمۚ  بَلۡ  أَنتُم  بِهَدِيَّتِكُمۡ  تَفۡرَحُونَ</p></div>
        <p class="t">เมื่ออ่านต่อเนื่องจะอ่านยาอฺเเต่เมืออ่านหยุดจะอ่านได้ 2 เเบบ  
        <br>1จะมีพยัญชนะยาอฺคงที่ อ่านว่า อาตานี 2.ตัดมีพยัญชนะยาอฺ อ่านว่า อาตาน </p>
        <br>
        <p>( อัร-รูม :37)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>

      
      <div class="ayat"><p> وَمَآ  ءَاتَيۡتُم  مِّن  رِّبٗا  لِّيَرۡبُوَاْ  فِيٓ  أَمۡوَٰلِ  ٱلنَّاسِ  فَلَا  يَرۡبُواْ  عِندَ  ٱللَّهِۖ  وَمَآ  ءَاتَيۡتُم  مِّن  زَكَوٰةٖ  تُرِيدُونَ  وَجۡهَ  ٱللَّهِ  فَأُوْلَٰٓئِكَ  هُمُ  ٱلۡمُضۡعِفُونَ  </p></div>
        <p class="t">คำนี้จะมีวาวฟัตฮะฮฺ</p>
        <p>( อัร-รูม :39)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
</p>
       
      <div class="ayat"><p>  ٱللَّهُ  ٱلَّذِي  خَلَقَكُم  مِّن  ضَعۡفٖ  ثُمَّ  جَعَلَ  مِنۢ  بَعۡدِ  ضَعۡفٖ  قُوَّةٗ  ثُمَّ  جَعَلَ  مِنۢ  بَعۡدِ  قُوَّةٖ  ضَعۡفٗا  وَشَيۡبَةٗۚ  يَخۡلُقُ  مَا  يَشَآءُۚ  وَهُوَ  ٱلۡعَلِيمُ  ٱلۡقَدِيرُ  </p></div>
        <p class="t"> คำว่า ضَعۡفٖ เเละ  ضَعۡفٗا สามารถอ่านเป็นสระฟัตตะฮฺเเละฎอมมะฮฺก็ได้ เเต่สระฟัตตะอฺจะดีกว่า</p>
        <p>( อัร-รูม :54)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>

      
      <div class="ayat"><p> وَأَنذِرۡهُمۡ  يَوۡمَ  ٱلۡأٓزِفَةِ  إِذِ  ٱلۡقُلُوبُ  لَدَى  ٱلۡحَنَاجِرِ  كَٰظِمِينَۚ  مَا  لِلظَّٰلِمِينَ  مِنۡ  حَمِيمٖ  وَلَا  شَفِيعٖ  يُطَاعُ <p><br>
 وَلَوۡ  دُخِلَتۡ  عَلَيۡهِم  مِّنۡ  أَقۡطَارِهَا  ثُمَّ  سُئِلُواْ  ٱلۡفِتۡنَةَ  لَأٓتَوۡهَا  وَمَا  تَلَبَّثُواْ  بِهَآ  إِلَّا  يَسِيرٗا </p> </div>
       <br>
        <p class="t"> สองคำนี้เป้นมัดบาดัล อ่าน 2 อารอกะฮ</p> 
        <p>( ฆอฟิร :18, อัล-อะห์ซาบ:14)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
       
      <div class="ayat"><p>  فَأَعۡرَضُواْ  فَأَرۡسَلۡنَا  عَلَيۡهِمۡ  سَيۡلَ  ٱلۡعَرِمِ  وَبَدَّلۡنَٰهُم  بِجَنَّتَيۡهِمۡ  جَنَّتَيۡنِ  ذَوَاتَيۡ  أُكُلٍ  خَمۡطٖ  وَأَثۡلٖ  وَشَيۡءٖ  مِّن  سِدۡرٖ  قَلِيلٖ </p></div>
        <p class="t"> อ่านด้วยยาอฺไม่ใช่อาลิฟ</p>
        <p>( สะบะอ์ :16)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
      
      <div class="ayat"><p> قَالُواْ  يَٰوَيۡلَنَا  مَنۢ  بَعَثَنَا  مِن  مَّرۡقَدِنَاۜۗ  هَٰذَا  مَا  وَعَدَ  ٱلرَّحۡمَٰنُ  وَصَدَقَ  ٱلۡمُرۡسَلُونَ</p></div>
        <p class="t"> อ่านต่อเนื่องพร้อมสักตะฮฺ โดยการหยุดไม่หายใจ</p>
        <p>( ยาซีน :52)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
      

      <div class="ayat">وَقَالَ  ٱلَّذِينَ  كَفَرُواْ  رَبَّنَآ  أَرِنَا  ٱلَّذَيۡنِ  أَضَلَّانَا  مِنَ  ٱلۡجِنِّ  وَٱلۡإِنسِ  نَجۡعَلۡهُمَا  تَحۡتَ  أَقۡدَامِنَا  لِيَكُونَا  مِنَ  ٱلۡأَسۡفَلِينَ<p></div>
        <p class="t">อ่านซาลสระฟัตตะฮฺเเละนูนสระกัสเราะห์</p>
        <p>(ฟุศศีลัต : 29)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
 
      <div class="ayat">وَلَا  تَسۡتَوِي  ٱلۡحَسَنَةُ  وَلَا  ٱلسَّيِّئَةُۚ  ٱدۡفَعۡ  بِٱلَّتِي  هِيَ  أَحۡسَنُ  فَإِذَا  ٱلَّذِي  بَيۡنَكَ  وَبَيۡنَهُۥ  عَدَٰوَةٞ  كَأَنَّهُۥ  وَلِيٌّ  حَمِيمٞ<p></div>
        <p class="t">คำนี้อ่านเเบบตัซฮิล คือ การออกเเบบเสียงระหว่างฮัมเซาะฮฺกับอลิฟ</p>
        <p>( ฟุศศีลัต:44 )</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
      
      
      <div class="ayat"> حمٓ(1)عٓسٓقٓ(2)</div>
        <p class="t">เมื่ออ่านต่อเนื่องพยัญชนะอัยนฺเป้นมัดดฺลีนทจะอ่านได้ 2 เเบบ<br>1 อ่านว่า 6 ฮารอกะฮ 2 อ่านปานกลาง 4 ฮารอกะฮฺ</p>
        <p>( อัซ-ซูรอ:1,2)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
   
      <div class="ayat"> قُلۡ  أَرَءَيۡتُم  مَّا  تَدۡعُونَ  مِن  دُونِ  ٱللَّهِ  أَرُونِي  مَاذَا  خَلَقُواْ  مِنَ  ٱلۡأَرۡضِ  أَمۡ  لَهُمۡ  شِرۡكٞ  فِي  ٱلسَّمَٰوَٰتِۖ  ٱئۡتُونِي  بِكِتَٰبٖ  مِّن  قَبۡلِ  هَٰذَآ  أَوۡ  أَثَٰرَةٖ  مِّنۡ  عِلۡمٍ  إِن  كُنتُمۡ  صَٰدِقِينَ <p></div>
        <p class="t">ถ้าเริ่มอ่านจากคำนี้จะอ่านด้วยฮัมซะฮฺสระกัสเราะฮฺตามด้วยยาอฺ อ่านว่า อีตูนี </p>
        <p>( อัล-อะฮฺกอฟ:4)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>

       
      <div class="ayat"> وَلَا  تَلۡمِزُوٓاْ  أَنفُسَكُمۡ  وَلَا  تَنَابَزُواْ  بِٱلۡأَلۡقَٰبِۖ  بِئۡسَ  ٱلِٱسۡمُ  ٱلۡفُسُوقُ  بَعۡدَ  ٱلۡإِيمَٰنِۚ  وَمَن  لَّمۡ  يَتُبۡ  فَأُوْلَٰٓئِكَ  هُمُ  ٱلظَّٰلِمُونَ  <p></div>
        <p class="t">เมื่อเริ่มอ่านจากคำนี้จะอ่านได้ 2 เเบบ 
          <br> อลิส-มู <br>ลิส-มู </p>
        <p>( อัล-ฮุจุรอต:11)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
  
      <div class="ayat"> أَمۡ  عِندَهُمۡ  خَزَآئِنُ  رَبِّكَ  أَمۡ  هُمُ  ٱلۡمُصَۜيۡطِرُونَ  <p></div>
        <p class="t"> พยัญชนะซีนที่อยู่ใต็ศอด สามารถอ่านได้ทั้งพยัญชนะซีนเเละศอด เเต่อ่านด้วยพยัยชนะศอดดีกว่า</p>
        <p>( อัฏ-ฏูร:37)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
    
      
      <div class="ayat"> فَكَانَ  عَٰقِبَتَهُمَآ  أَنَّهُمَا  فِي  ٱلنَّارِ  خَٰلِدَيۡنِ  فِيهَاۚ  وَذَٰلِكَ  جَزَٰٓؤُاْ  ٱلظَّٰلِمِينَ <p></div>
        <p class="t">อ่านดาลสระฟัตฮะฮฺเเละยาอฺสูกูน</p>
        <p>(อัล-อัชร์ :17 )</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>

      <div class="ayat"><p></div>
        <p class="t"></p>
        <p>( :)</p> <br>
      <audio controls >
      <source src="" type="">
      </audio>
      <br>
</div>
</div>
</div>
       
    
          