@extends('quran.navbar')
<br>
<br>
<br>
<br>
<br>
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>

    <Style>
        .taj{
            text-align:center;
            color:#008997;
        }

    </Style>

</head>
<body>
    <h1 class="taj"> Tajweed</h1>

<h2> 1. นูนตาย </h2>
<p> Nun-Sakeenah is fibngobingobnbiosdfnboinionioavnoibnioagni there are 5</p>

<div>
<h5> 1.1 อิซฮาร ฮากีกีย์ </h5>
<p>  คือ การอ่านที่ชัดเจน หมายถึง การอ่านที่ชัดเจนโดยที่ไม่หน่วงเสียง อ่านชัดอักษรนูนตาย สระซ้อนสอง และชัดอักษรอิซฮารทั้งหมดตัวอย่าง เช่น </p>

</div>

<div>
<h5> 1.2 อิดฆอมมะอัลฆุนนะห์ </h5>
<p>
    คือ การอ่านเข้ากัน (กล้ำกัน) พร้อมหน่วงเสียง
</p>
</div>

<div>
<h5> 1.3 อิดฆอมบิลาฆุนนะห์ </h5>
<p>
    คือ การอ่านเข้ากัน (กล้ำกัน) โดยที่ไม่หน่วงเสียง
</p>
</div>

<div>
<h5> 1.4 อิคฟาอ ฮากีกีย์ </h5>
<p>
    คือ การอ่านก้ำกึ่ง หรืออ่านซ่อนเสียง หรือการอ่านครึ่งของนูน หรือตันวีด และไปพบกับอักษรอิคฟาอ์พร้อมกับหน่วงเสียงเข้ากัน (กล้ำกัน) โดยไม่หน่วงเสียง
</p>
</div>

<div>
<h5> 1.5 อิกลาบ </h5>
<p>
    คือ การอ่านเปลี่ยนเสียงพร้อมทั้งหน่วงเสียง หมายถึง การอ่านหน่วงเสียงของอักษรนูนตาย หรือ ตันวีน ให้เป็นเสียงอักษรมีม (ห้ามปิดปากมิดชิดระหว่างออกเสียงมีม) แล้วไปพบกับอักษร บา พร้อมกับหน่วงเสียง
</p>
</div>

<h2> 2. Meem-Sakeenah </h2>
<p> อักษรมีมตาย จะเกิดบะะดาฮุกม 5 ฮุกม </p>

<div>
    <h2> 2.1 อิดฆอมมุตะมาษีลัยนมะกัลฆุนนะห์ซอฆีร </h2>
    <p> การอ่านเข้ากันพร้อมหน่วงเสียง โดยเฉพาะอักษรมีม </p>
</div>

<div>
    <h2> 2.2 อิคฟาอซาฟาวีย์ </h2>
    <p> การอ่านซ่อนเสียงอักษรริมฝีปาก </p>
</div>

<div>
    <h2> 2.3 อิซฮารซาฟาวีย์อะซัด </h2>
    <p> การอ่านซัดที่อักษรริมฝีปาก และเน้นเสียง </p>
</div>

<div>
    <h2> 2.4 อิซฮัรญาอิซ </h2>
    <p> การอนุญาตให้ออกเสียงให้ชัดเจน ฮุกมนี้อนุญาตให้ตั้งชื่อใหม่ และอนุญาตให้อ่านออกเสียงชัดเจน ห้ามมิให้อ่านเป็นอิดฆอม (อ่านเข้ากัน) </p>
</div>

<div>
    <h2> 2.5 อิซฮัรซาฟาวีย์ </h2>
    <p> การอ่านออกเสียงที่ชัดเจนที่ริมฝีปาก โดยไม่หน่วงเสียง </p>
</div>



</body>
</html>