app/Http/Controllers/NoteController.php

    public function index()
    {
        //

        $data = Note::paginate(5);
---
select * from `notes` limit 5 offset 0
select count(*) as aggregate from `notes`