app/Http/Controllers/NoteController.php

    public function index()
    {
        //
        $datas = Datasurah::all();
---
select * from `datasurahs`