app/Http/Controllers/QuransController.php

    public function homepage()
    {
        $datasurahs = Datasurah::all();
---
select * from `datasurahs`

    public function arabic($id)
    {
        $datas = Datasurah::all();
        $datasurah = Datasurah::with('tafseer')->find($id);
        $tafseers = Datasurah::with('qurantafseer')->find($id);
        $arabics = Datasurah::with('arabic.thais')->find($id);
---
select * from `datasurahs`
select * from `datasurahs` where `datasurahs`.`id` = '1' limit 1
select * from `tafseers` where `tafseers`.`datasurah_id` in (1)
select * from `qurantafseers` where `qurantafseers`.`datasurah_id` in (1)
select * from `arabics` where `arabics`.`datasurah_id` in (1)
select * from `thais` where `thais`.`id` in (1, 2, 3, 4, 5, 6, 7)

     public function tafseer_home()
    {
            $datasurahs = Datasurah::paginate(20);
---
select * from `datasurahs` limit 20 offset 0
select count(*) as aggregate from `datasurahs`

    public function tafseer_detail($id)
    {
        $tafseers = Datasurah::with('tafseer')->find($id);
---
select * from `datasurahs` where `datasurahs`.`id` = '2' limit 1
select * from `tafseers` where `tafseers`.`datasurah_id` in (2)