app/Http/Controllers/QuranController.php

select * from `datasurahs`
---
    public function homeuser()
    {

            $datasurahs = Datasurah::all();

select * from `arabics` where `arabics`.`datasurah_id` in (3)
select * from `datasurahs` where `datasurahs`.`id` = '3' limit 1
select * from `thais` where `thais`.`id` in (294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493)
select * from `datasurahs`
select * from `tafseers` where `tafseers`.`datasurah_id` in (3)
select * from `qurantafseers` where `qurantafseers`.`datasurah_id` in (3)
---
    public function surah($id)

    {
        $arabics = Datasurah::with('arabic.thais')->find($id);
        $datas = Datasurah::all();
        $datasurah = Datasurah::with('tafseer')->find($id);
        $tafseers =Datasurah::with('qurantafseer')->find($id);

select * from `datasurahs` limit 20 offset 0
select count(*) as aggregate from `datasurahs`
---
    public function tafseer_homeuser()
    {

            $datasurahs = Datasurah::paginate(20);

select * from `datasurahs` where `datasurahs`.`id` = '1' limit 1
select * from `tafseers` where `tafseers`.`datasurah_id` in (1)
---
    public function tafseer_detailuser($id)
    {
        $tafseers = Datasurah::with('tafseer')->find($id);