app/Http/Controllers/SearchController.php

select `datasurahs`.`th_name`, `datasurahs`.`id`, `arabics`.`id`, `arabics`.`text`, `thais`.`Text`, `arabics`.`ayat`, `thais`.`datasurah_id` from `datasurahs` inner join `arabics` on `arabics`.`datasurah_id` = `datasurahs`.`id` inner join `thais` on `thais`.`id` = `arabics`.`id` where `arabics`.`text` LIKE '%อัล-ฟาติหะ%' or `thais`.`Text` like '%อัล-ฟาติหะ%' or `arabics`.`datasurah_id` like '%อัล-ฟาติหะ%' or `datasurahs`.`th_name` like '%อัล-ฟาติหะ%' limit 10 offset 0
select count(*) as aggregate from `datasurahs` inner join `arabics` on `arabics`.`datasurah_id` = `datasurahs`.`id` inner join `thais` on `thais`.`id` = `arabics`.`id` where `arabics`.`text` LIKE '%อัล-ฟาติหะ%' or `thais`.`Text` like '%อัล-ฟาติหะ%' or `arabics`.`datasurah_id` like '%อัล-ฟาติหะ%' or `datasurahs`.`th_name` like '%อัล-ฟาติหะ%'
---
    function find(Request $request){
            $request->validate([
              'query'=>'required|min:1'
           ]);

           $query = $request->input('query');

           $texts =  DB::table('datasurahs')
           ->join('arabics','arabics.datasurah_id', '=', 'datasurahs.id')
           ->join('thais', 'thais.id', '=', 'arabics.id')

           ->select('datasurahs.th_name','datasurahs.id','arabics.id', 'arabics.text','thais.Text','arabics.ayat','thais.datasurah_id')

                      ->where('arabics.text','LIKE','%'.$query.'%')
                     //->orWhere('id','<', 114)
                     // ->orWhere('thais.Text','like','%'.$search_text.'%')
                     ->orWhere('thais.Text','like','%'.$query.'%')

                      ->orWhere('arabics.datasurah_id','like','%'.$query.'%')
                      //->orWhere('arabics.id','like','%'.$search_text.'%')
                      ->orWhere('datasurahs.th_name','like','%'.$query.'%')

                    //   ->map(function ($row) use ($query) {
                    //     $row->input = preg_replace('/(' . $query . ')/i', "<b>$1</b>", $row->input);
                    //     return $row;
                    // })

                      ->paginate(10);