@extends('quran.navbar')

<style>
.t {
  background-color: white;
  color: black;
  font-family:  serif;
        font-size: 15px;
        font-weight: normal;
        direction: rtl;
        padding: 0;
        margin: 0;
}
@font-face {
    font-family: quran-font;
    font-style: normal;
    font-weight: 400;
    src: url('assets/font/AmiriQuranColored.woff') format('truetype');
  }
  
  .quran-font {
    font-family: quran-font;
    font-size: 26px;
    color: black;
  }
  .ayat{
     font-family: quran-font;
     direction: rtl;
     font-size: 26px;
     line-height: 200%;
     color: black;
   }
   .ayat .kalimah{
    font-family: quran-font;
     direction: rtl;
     font-size: 26px;
     line-height: 200%;
     color: green;
   }
   .highlight{ 
  background:black; 
  padding:1px; 
  border:#00CC00 dotted 1px; 
}
</style>
<br>
    <br>
 <div style = background-color:white; class="search-area">
 <div class="row">
    <div class="col-md-8 mx-auto">
<br>

   
        <h1>คำที่ควรสังเกตในอัลกุรอาน</h1>
        <p>คำที่ควรสังเกตเเละต้องระมัดระวังในการอ่านอัลกุรอาน</p>
        
        <div class="ayat"><p>وَٱللَّهُ يَقْبِضُ <span class="kalimah">وَيَبْصُۜطُ</span> وَإِلَيْهِ تُرْجَعُونَ </p></div>
        <p class="t">พยัญชนะขึ้นที่อยู่บนพยัญชนะสอด จะอ่านด้วยพยัญชนะขึ้นอย่างเดียว</p>
        <p>(อัล-บะเกาะเราะฮ : 245)</p>
        <div class="ayat"><p></span> أَمْ عِندَهُمْ خَزَآئِنُ رَبِّكَ أَمْ هُمُ<span class="kalimah"> ٱلْمُصَۣيْطِرُونَ </span></p></div>
        <p class="t">พยัญชนะซีนที่อยู่ล่างพยัญชนะศอด จะอ่านด้วยพยัญชนะขึ้นหรือสอดก็ได้</p>
        <p>(อัฏ-ฏูร : 37)</p>
        
        <div class="ayat"><p> فَإِنْ أَمِنَ بَعْضُكُم بَعْضًا فَلْيُؤَدِّ الَّذِي <span class="kalimah">اؤْتُمِنَ</span> أَمَانَتَهُ وَلْيَتَّقِ اللَّهَ رَبَّهُ </p></div>
        <p class="t">อ่านว่า อูตูมีนา ถ้าเริ่มอ่านจากคำนี้จะอ่านฮัมซะฮฺแรกฎอมมะอฺ ฮัมซะฮฺ ที่สองเป็นสกูน</p>
        <p>(อัล-บะเกาะเราะฮ : 283)</p>
         
        <div class="ayat"><p>الٓمٓ(١) ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ (٢)</p></div>
        <p class="t">เวลาอ่านต่อเนื่องจาก 2 คำนี้จะอ่าน มีม สระฟัตฮะฮฺ แต่ยายกับทีมนั้น อ่านได้ 2 แบบ ดังนี้ 
           <br> 
           อ่านยาวตามตัวเดิม 6 ฮารอกะฮฺ -อ่านสั้นเหมือนมัดดุเฏาะบีอีย 2 ฮารอกะฮฺ</p>
        <p>(อัล-อิมรอน : 1-2)</p>
        

        <div class="ayat"><p>ثَمَانِيَةَ أَزْوَاجٍ مِّنَ الضَّأْنِ اثْنَيْنِ وَمِنَ الْمَعْزِ اثْنَيْنِ قُلْ آلذَّكَرَيْنِ حَرَّمَ أَمِ الْأُنثَيَيْنِ أَمَّا اشْتَمَلَتْ عَلَيْهِ أَرْحَامُ الْأُنثَيَيْنِ نَبِّئُونِي بِعِلْمٍ إِن كُنتُمْ صَادِقِينَ ( 143 )    وَمِنَ الْإِبِلِ اثْنَيْنِ وَمِنَ الْبَقَرِ اثْنَيْنِ قُلْ آلذَّكَرَيْنِ حَرَّمَ أَمِ الْأُنثَيَيْنِ  </p></div>
        <p class="t">จะอ่านฮัมซะฮวาสัลตรงนี้ได้ 2 แบบ 1 อ่านแบบมัดบาดัล อ่านยาว 6 ฮารอกะฮฺ 2 อ่านแบบตัสฮีล คือ ออกเสียงฮัมเซาะฮฺที่สองระหว่างอลิฟกับฮัมเซาะฮฺ 2 ฮารอกะฮฺ</p>
        <p>(อัล-อันอาม : 143-144)</p>
       
       
        <div class="ayat"><p> أَوَعَجِبْتُمْ أَن جَآءَكُمْ ذِكْرٌۭ مِّن رَّبِّكُمْ عَلَىٰ رَجُلٍۢ مِّنكُمْ لِيُنذِرَكُمْ ۚ وَٱذْكُرُوٓا۟ إِذْ جَعَلَكُمْ خُلَفَآءَ مِنۢ بَعْدِ قَوْمِ نُوحٍۢ وَزَادَكُمْ فِى ٱلْخَلْقِ بَصْۜطَةًۭ ۖ فَٱذْكُرُوٓا۟ ءَالَآءَ ٱللَّهِ لَعَلَّكُمْ تُفْلِحُونَ ٦٩</p></div>
        <p class="t">การออกเสียงซีนอย่างเดียว</p>
        <p>(อัล-อะอฺรอฟ : 69)</p>
        
       
        <div class="ayat"><p>وَٱلَّذِينَ يُمَسِّكُونَ بِٱلْكِتَـٰبِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ إِنَّا لَا نُضِيعُ أَجْرَ ٱلْمُصْلِحِينَ ١٧٠ </p></div>
        <p class="t">อ่านมีมสระฟัตฮะฮฺเเละซีนมีซัดดะฮฺ</p>
        <p>(อัล-อะอฺรอฟ : 170)</p>
        
        <div class="ayat"><p>إِنَّ وَلِيِّيَ اللَّهُ الَّذِي نَزَّلَ الْكِتَابَ وَهُوَ يَتَوَلَّى الصَّالِحِينَ (196 ) </p></div>
        <p class="t">เป็นมัดตัมกีน อ่าน 2 ฮารอกะฮฺ</p>
        <p>(อัล-อะอฺรอฟ : 196)</p>
        
        <p> การอ่านท้ายสูเราะฮฺอัลอันฟาลกับต้นสูเราะฮฺอัตเตาบะฮฺ</p>
        <div class="ayat"><p>هِ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ ( 75 )  بَرَآءَةٌۭ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلَّذِينَ عَـٰهَدتُّم مِّنَ ٱلْمُشْرِكِينَ (1)</p></div>
        <p class="t">อ่านต่อเนื่องท้ายสูเราะฮฺอัลอันฟาลกับต้นสูเราะฮฺอัตเตาบะฮฺ ได้ 3 แบบ 1.อ่านหยุดพร้อมหายใจ  2.อ่านสักตะฮฺไม่หายใจ  3.อ่านต่อเนื่องพร้อมหน่วงเสียง</p>
        <p>(อัล-อันฟาล : 75),(อัตเตาบะฮฺ : 1)</p>


        <div class="ayat"><p> قُلْ هَلْ مِن شُرَكَآئِكُم مَّن يَهْدِىٓ إِلَى ٱلْحَقِّ ۚ قُلِ ٱللَّهُ يَهْدِى لِلْحَقِّ ۗ أَفَمَن يَهْدِىٓ إِلَى ٱلْحَقِّ أَحَقُّ أَن يُتَّبَعَ أَمَّن لَّا يَهِدِّىٓ إِلَّآ أَن يُهْدَىٰ ۖ فَمَا لَكُمْ كَيْفَ تَحْكُمُونَ(35)</p></div>
        <p class="t">อ่านหยุดที่คำนี้เป็นกอลกอลาฮฺกุบรอ</p>
        <p>(ยูนุส : 35)</p>

        <div class="ayat"><p> </p></div>
        <p class="t"></p>
        <p>(อัล-อะอฺรอฟ : 69)</p>
        
        <div class="ayat"><p> </p></div>
        <p class="t"></p>
        <p>(อัล-อะอฺรอฟ : 69)</p>
        
        <p>10.</p>
        <p>أَثُمَّ إِذَا مَا وَقَعَ ءَامَنتُم بِهِۦٓ ۚ ءَآلْـَٔـٰنَ وَقَدْ كُنتُم بِهِۦ تَسْتَعْجِلُونَ (51)</p>
        <p>ءَآلْـَٔـٰنَ وَقَدْ عَصَيْتَ قَبْلُ وَكُنتَ مِنَ ٱلْمُفْسِدِينَ(91)</p>
        <p>สามารถอ่านได้สองแบบ  1-อ่านยาว6ฮารอกะฮ 2- ออกเสียงฮัมเซาะฮวาลระหว่างฮัมเซาะฮฺกับอลิฟ</p>
         
        <p>11.</p>
        <p>قُلْ أَرَءَيْتُم مَّآ أَنزَلَ ٱللَّهُ لَكُم مِّن رِّزْقٍۢ فَجَعَلْتُم مِّنْهُ حَرَامًۭا وَحَلَـٰلًۭا قُلْ ءَآللَّهُ أَذِنَ لَكُمْ ۖ أَمْ عَلَى ٱللَّهِ تَفْتَرُونَ(59)</p>
        <p>จะอ่านฮัมซะฮฺวาสัลตรงนี้ได้ 2 แบบ 1 อ่านยาว 6 บารอกะฮฺ 2 ออกเสียงฮัมเซาะฮฺที่สองระหว่างอลิฟกับฮัมเซาะฮฺ</p>

        <p>12.</p>
        <p>() وَقَالَ ٱرْكَبُوا۟ فِيهَا بِسْمِ ٱللَّهِ مَجْر۪ىٰهَا وَمُرْسَىٰهَآ ۚ إِنَّ رَبِّى لَغَفُورٌۭ رَّحِيمٌۭ (41) وَهِىَ تَجْرِى بِهِمْ فِى مَوْجٍۢ كَٱلْجِبَالِ وَنَادَىٰ نُوحٌ ٱبْنَهُۥ وَكَانَ فِى مَعْزِلٍۢ يَـٰبُنَىَّ ٱرْكَب مَّعَنَا وَلَا تَكُن مَّعَ ٱلْكَـٰفِرِينَ۞</p>
        <p>คำนี้จะออกเสียงเป็น มัจ-เร-ฮา</p>

        <p>13.</p>
        <p>(42)مَعْزِلٍۢ يَـٰبُنَىَّ ٱرْكَب مَّعَنَا وَلَا تَكُن مَّعَ ٱلْكَـٰفِرِينَ</p>
        <p>พยัญชนะบาอฺกับมีมตรงนี้ ต้องอิดฆอมให้สมบูรณ์พร้อมขัดดะฮฺ</p>

        <p>14.</p>
        <p>(11) قَالُوا۟ يَـٰٓأَبَانَا مَا لَكَ لَا تَأْمَ۫نَّا عَلَىٰ يُوسُفَ وَإِنَّا لَهُۥ لَنَـٰصِحُونَ</p>
        <p>อ่านได้ 2 แบบ 1. อ่านว่า ตะ-มา-นู-นา 2. อ่านว่า ตะ-มัน........นาน โดยยื่นริมฝีปากพร้อมหน่วงเสียง</p>
       
        <p>15.</p>
        <p>(2)ٱلْحَمْدُ لِلَّهِ ٱلَّذِىٓ أَنزَلَ عَلَىٰ عَبْدِهِ ٱلْكِتَـٰبَ وَلَمْ يَجْعَل لَّهُۥ عِوَجَاۜ(1) قَيِّمًۭا لِّيُنذِرَ بَأْسًۭا شَدِيدًۭا مِّن لَّدُنْهُ وَيُبَشِّرَ ٱلْمُؤْمِنِينَ ٱلَّذِينَ يَعْمَلُونَ ٱلصَّـٰلِحَـٰتِ أَنَّ لَهُمْ أَجْرًا حَسَنًۭا</p>
        <p>(15) อ่านต่อเนื่องเป็นสักตะฮฺ</p>

        <p>16.</p>
        <p>(10)إِنَّ ٱلَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ ٱللَّهَ يَدُ ٱللَّهِ فَوْقَ أَيْدِيهِمْ ۚ فَمَن نَّكَثَ فَإِنَّمَا يَنكُثُ عَلَىٰ نَفْسِهِۦ ۖ وَمَنْ أَوْفَىٰ بِمَا عَـٰهَدَ عَلَيْهُ ٱللَّهَ فَسَيُؤْتِيهِ أَجْرًا عَظِيمًۭا</p>
        <p>อ่านฮาอฺสระฏอมมะฮฺ</p>

        <p>17.</p>
        <p>(1)كٓهيعٓصٓ</p>
        <p>พยัญชนะอัยน์ สามารถอ่านได้ 2 แบบ 1- อ่านยาว 6 ฮารอกะฮฺ 2- อ่านปานกลาง 4 ฮารอกะฮฺ</p>

        <p>18.</p>
        <p>อัล-ฟุรกอน(38)وَعَادًا وَثَمُودَ وَأَصْحَابَ الرَّسِّ وَقُرُونًا بَيْنَ ذَٰلِكَ كَثِيرً </p>
       
    
   <p>222222</p>

</div>
</div>
</div>
     
          